## Basic of Manipulating Pandas DateFrames

Adapted from "Manipulating DataFrames with pandas" @ [DataCamp](https://www.datacamp.com/courses/manipulating-dataframes-with-pandas)

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('./sales.csv', index_col='month')
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [8]:
df.shape
df.index
df.columns
df.info()
df.count()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Jan to Jun
Data columns (total 3 columns):
eggs    6 non-null int64
salt    5 non-null float64
spam    6 non-null int64
dtypes: float64(1), int64(2)
memory usage: 192.0+ bytes

eggs    6
salt    5
spam    6
dtype: int64

## Indexing DataFrames
### Indexing with square brackets

In [9]:
df['salt']['Jan']

12.0

### Using column attribute and row label

In [10]:
 df.eggs['Mar']

221

In [11]:
df['eggs'][]

221

### Using the .loc accessor

In [12]:
df.loc['May', 'spam']

52

### Using the .iloc accessor

In [13]:
df.iloc[4, 2]

52

### Selecting only some columns

In [14]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [15]:
df_new =  df[['salt','eggs']]
df_new

       salt  eggs
month
Jan    12.0    47
Feb    50.0   110
Mar    89.0   221
Apr    87.0    77
May     NaN   132
Jun    60.0   205

## Slicing DataFrames

In [16]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

### Selecting a column (i.e., Series)

In [17]:
df['eggs']

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [18]:
type(df['eggs'])

pandas.core.series.Series

### Slicing and indexing a Series

In [19]:
df['eggs'][1:4] # Part of the eggs column

month
Feb    110
Mar    221
Apr     77
Name: eggs, dtype: int64

In [20]:
df['eggs'][4] # The value associated with May

132

### Using .loc[]

In [21]:
df.loc[:, :] # All rows, all columns

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [22]:
df.loc[:, 'eggs':'salt'] # All rows, some columns

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

In [23]:
 df.loc['Jan':'Apr',:] # Some rows, all columns

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20

In [24]:
 df.loc['Mar':'May', 'salt':'spam'] # Some rows, some columns

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

In [25]:
 df.iloc[2:5, 1:] # A block from middle of the DataFrame

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

### Using lists rather than slices

In [26]:
df.loc['Jan':'May', ['eggs', 'spam']]

       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72
Apr      77    20
May     132    52

In [27]:
 df.iloc[[0,4,5], 0:2]

       eggs  salt
month
Jan      47  12.0
May     132   NaN
Jun     205  60.0

### Series versus 1-column DataFrame

In [28]:
df['eggs']

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [29]:
type(df['eggs'])

pandas.core.series.Series

In [30]:
 df[['eggs']]

       eggs
month
Jan      47
Feb     110
Mar     221
Apr      77
May     132
Jun     205

In [31]:
 type(df[['eggs']])

pandas.core.frame.DataFrame

## Filtering DataFrames

### Creating a Boolean Series

In [32]:
 df.salt > 60

month
Jan    False
Feb    False
Mar     True
Apr     True
May    False
Jun    False
Name: salt, dtype: bool

### Filtering with a Boolean Series

In [33]:
 df[df.salt > 60]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

In [34]:
 enough_salt_sold = df.salt > 60

In [35]:
df[enough_salt_sold]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

### DataFrames with zeros and NaNs

In [39]:
df2 = df.copy()

In [41]:
df2['bacon'] = [0, 0, 50, 60, 70, 80]  # add a new column
df2['sushi'] = [0, 0, 0, 0, 0, 0]

In [42]:
df2

       eggs  salt  spam  bacon  sushi
month
Jan      47  12.0    17      0      0
Feb     110  50.0    31      0      0
Mar     221  89.0    72     50      0
Apr      77  87.0    20     60      0
May     132   NaN    52     70      0
Jun     205  60.0    55     80      0

### Select columns with all nonzeros

In [43]:
 df2.loc[:, df2.all()]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

### Select columns with any nonzeros

In [44]:
 df2.loc[:, df2.any()]

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

### Select columns with any NaNs

In [45]:
 df2.loc[:, df2.isnull().any()]

       salt
month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0

### Select columns without NaNs

In [46]:
df2.loc[:, df2.notnull().all()]

       eggs  spam  bacon  sushi
month
Jan      47    17      0      0
Feb     110    31      0      0
Mar     221    72     50      0
Apr      77    20     60      0
May     132    52     70      0
Jun     205    55     80      0

### Drop rows with any NaNs

In [47]:
df2

       eggs  salt  spam  bacon  sushi
month
Jan      47  12.0    17      0      0
Feb     110  50.0    31      0      0
Mar     221  89.0    72     50      0
Apr      77  87.0    20     60      0
May     132   NaN    52     70      0
Jun     205  60.0    55     80      0

In [48]:
df2.dropna(how ='any')

       eggs  salt  spam  bacon  sushi
month
Jan      47  12.0    17      0      0
Feb     110  50.0    31      0      0
Mar     221  89.0    72     50      0
Apr      77  87.0    20     60      0
Jun     205  60.0    55     80      0

### Filtering a column based on another

In [49]:
df2.eggs[df2.salt > 55]

month
Mar    221
Apr     77
Jun    205
Name: eggs, dtype: int64

### Drop a row

In [50]:
df2.drop('Jan')

       eggs  salt  spam  bacon  sushi
month
Feb     110  50.0    31      0      0
Mar     221  89.0    72     50      0
Apr      77  87.0    20     60      0
May     132   NaN    52     70      0
Jun     205  60.0    55     80      0

### Drop a column

In [51]:
df2.drop('sushi', axis = 1)

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

## Transforming DataFrames

In [52]:
def dozens(n): 
    return n//12

In [53]:
df.apply(dozens)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     4

In [54]:
df.apply(lambda n: n//12)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     4

### The DataFrame index

In [55]:
df2

       eggs  salt  spam  bacon  sushi
month
Jan      47  12.0    17      0      0
Feb     110  50.0    31      0      0
Mar     221  89.0    72     50      0
Apr      77  87.0    20     60      0
May     132   NaN    52     70      0
Jun     205  60.0    55     80      0

In [56]:
df2.index

Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun'], dtype='object', name='month')

### Working with string values

In [57]:
df2.index = df2.index.str.upper()

In [58]:
df2

       eggs  salt  spam  bacon  sushi
month
JAN      47  12.0    17      0      0
FEB     110  50.0    31      0      0
MAR     221  89.0    72     50      0
APR      77  87.0    20     60      0
MAY     132   NaN    52     70      0
JUN     205  60.0    55     80      0

In [59]:
df.index = df.index.map(str.lower)

In [60]:
df2

       eggs  salt  spam  bacon  sushi
month
JAN      47  12.0    17      0      0
FEB     110  50.0    31      0      0
MAR     221  89.0    72     50      0
APR      77  87.0    20     60      0
MAY     132   NaN    52     70      0
JUN     205  60.0    55     80      0

### Defining columns using other columns

In [61]:
df2['salty_eggs'] = df2.salt + df2.eggs

In [62]:
df2

       eggs  salt  spam  bacon  sushi  salty_eggs
month
JAN      47  12.0    17      0      0        59.0
FEB     110  50.0    31      0      0       160.0
MAR     221  89.0    72     50      0       310.0
APR      77  87.0    20     60      0       164.0
MAY     132   NaN    52     70      0         NaN
JUN     205  60.0    55     80      0       265.0

## Exercises
### Read in the data from sales1.csv
1. Create a dataframe with all information for software sales
2. Create a dataframe with only the product and unit information for company named 'Hooli'

In [64]:
df = pd.read_csv('./sales1.csv', index_col='Date')

In [65]:
df

                             Company   Product  Units
Date
2015-02-02 08:30:00            Hooli  Software      3
2015-02-02 21:00:00        Mediacore  Hardware      9
2015-02-03 14:00:00          Initech  Software     13
2015-02-04 15:30:00        Streeplex  Software     13
2015-02-04 22:00:00  Acme Coporation  Hardware     14
2015-02-05 02:00:00  Acme Coporation  Software     19
2015-02-05 22:00:00            Hooli   Service     10
2015-02-07 23:00:00  Acme Coporation  Hardware      1
2015-02-09 09:00:00        Streeplex   Service     19
2015-02-09 13:00:00        Mediacore  Software      7
2015-02-11 20:00:00          Initech  Software      7
2015-02-11 23:00:00            Hooli  Software      4
2015-02-16 12:00:00            Hooli  Software     10
2015-02-19 11:00:00        Mediacore  Hardware     16
2015-02-19 16:00:00        Mediacore   Service     10
2015-02-21 05:00:00        Mediacore  Software      3
2015-02-21 20:30:00            Hooli  Hardware      3
2015-02-25 00:30:00          Initech   Service     10
2015-02-26 09:00:00        Streeplex   Service      4

In [66]:
 df[df.Product == 'Software']

                             Company   Product  Units
Date
2015-02-02 08:30:00            Hooli  Software      3
2015-02-03 14:00:00          Initech  Software     13
2015-02-04 15:30:00        Streeplex  Software     13
2015-02-05 02:00:00  Acme Coporation  Software     19
2015-02-09 13:00:00        Mediacore  Software      7
2015-02-11 20:00:00          Initech  Software      7
2015-02-11 23:00:00            Hooli  Software      4
2015-02-16 12:00:00            Hooli  Software     10
2015-02-21 05:00:00        Mediacore  Software      3

In [73]:
df.loc[df.Company == 'Hooli', ['Product', 'Units']]

                      Product  Units
Date
2015-02-02 08:30:00  Software      3
2015-02-05 22:00:00   Service     10
2015-02-11 23:00:00  Software      4
2015-02-16 12:00:00  Software     10
2015-02-21 20:30:00  Hardware      3